{
  "skills": [
    {
      "title":"Data",
      "p":[ "Kubernetes","Elasticsearch","Spark","Kafka", "Airflow"]
    },
    {
      "title":"Backend/Web",
      "p":["Node.js","Mongodb","Webpack","Sass"]
    },
    {
      "title":"General",
      "p":["Python","Git", "Google Cloud platform", "Jenkins","Docker","iOS(Swift)"]
    }
  ]
  ,"work":[
    {
      "title":"Vpon Taiwan",
      "image":"",
      "location":"Taipei, Taiwan",
      "time":"2018 Oct -> Present",
      "position":"Data Engineer (Architect)",
      "web":"<a href='https://www.vpon.com' target='_blank'>Vpon</a>",
      "p":[
          "1: Data migration: Transfer existing projects and migrate the ETL pipeline from AWS to GCP. Set up a Gitlab server in GCP. Transfer data from Hive and S3 to GCP. Implement ETL pipeline for effective and efficient data migration.",
          "2: Infrastructure: Design the archtectures for Gitlab CI/CD, ETL flow, and data processing pipeline using Google Cloud Platform and Amazon Web Service such as Google Kubernetes Engine with Istio, BigQuery, Cloud Function, and GCE.",
          "3: CI/CD: Design the complete CI/CD pipeline including building Docker images, conducing unit tests, deploying to Container Registry, and deploying images on the Kubernetes cluster.",
          "4: Build up a platform for highly customized tagging services. The platfrom gives each individual ID different kinds of tags such as personal interests, language, age, and gender and reports the tagging rate of each tag.",
          "5: ETL pipeline: Design and deploy ETL pipelines on Apache Airflow, Cloud Functions and Kubernetes  for daily cronjobs of data processing on the platform, data exchange with our partners.",
          "6: Elastic Stack: Process millions of data records and validate data every day. The report can be observed in real time."
      ]
    },
    {
      "title":"PDIS (Public Digital Innovation Space)",
      "image":"./assets/image/pdis.png",
      "location":"Executive Yuan 行政院, Taipei, Taiwan",
      "time":"2017 Sep -> 2018 Aug",
      "position":"Software Engineer in (Alternative Military Service)",
      "web":"<a href='https://pdis.nat.gov.tw' target='_blank'>PDIS</a>",
      "p":[
          "PDIS is a government organization in Taiwan, it also has another name: Executive Yuan - Ministry of Digital - Audrey Tang's 唐鳳 Office.
          She leads the PDIS team to help our government.
          We incubate and facilitate public digital innovation for government.
          ",
          "1: As a software developer: I use Line BOT API to connect our internal systems to make an easy-to-use app to help our colleagues saving their time. I also designed API interfaces to allow other internal systems to hook up with our bot system.Up to now, it already bridged across our meeting reserve system and electronic bulletin board system.",
          "2: About productive and quality: I designed a software that can display real-time subtitle during streaming. To meet the schedule, I took only one week to make it from idea to prototype. This system now works perfectly in all of our video conferences.",
          "3: As a quick learner and contributor: I involved in many open source projects. Like Sandstorm(A open source private cloud with the container), Rocket.Chat(A open source chat app which like Slack). We have fixed many issues and add lots of features, and giving back to the community.",
          "4: Eager to learn everything: when I have free time, I like to think about how to make the system more efficient. I still find more possibility to improve the current system. Like the subtitle display system, I would like to let some part of the system can automatically work. Let the computer can label the people with their name in real-time and display the information on the subtitle. On the road of development, I fixed various issues and bugs of Tensorflow. NVIDIA give me an award as the outstanding community developer in this April."
      ],
      "more":""
    },
    {
      "title":"91app (Nexdoor)",
      "image":"./assets/image/91app.jpg",
      "location":"Taipei, Taiwan",
      "time":"2013 Jul -> 2014 Sep",
      "position":"iOS Engineer (Intern)",
      "web":"<a href='https://www.91app.com' target='_blank'>Chinese(TW)</a>",
      "p":[
          "Nexdoor is a famous App company in 2013, we build iOS/Android/Web for the enterprise. I was an iOS Engineer Intern when I was an undergraduate student.
          I developed some interesting project, like Geofenece App, LBS Service framework and customize UI. In 2016, most of the employee join new company 91 app."
      ],
      "more":""
    }
  ]

}
