{
  "skills": [
    {
      "title":"Data",
      "p":[ "Kubernetes","Elasticsearch","Spark","Kafka", "Airflow"]
    },
    {
      "title":"Backend/Web",
      "p":["Node.js","Mongodb","Webpack","Sass"]
    },
    {
      "title":"General",
      "p":["Python","Git", "Google Cloud platform", "Jenkins","Docker","iOS(Swift)"]
    }
  ]
  ,"work":[
    {
      "title":"Vpon Taiwan",
      "image":"",
      "location":"Taipei, Taiwan",
      "time":"2018 Oct -> Present",
      "position":"Data Engineer (Architect) at Data Team",
      "web":"<a href='https://www.vpon.com' target='_blank'>Vpon</a>",
      "p":[
          "In data team, I am responsible for building up data infrastructures and designing pipelines. I have huge passion for learning new knowledge and sharing with members. In addition, I am expert in optimizing the performance of a system by introducing new technology.",
          "<h5>Data Collection and Exchange:</h5>",
          "1. Design different algorithms and pipelines for automatic data exchange with business partners.",
          "2. Design the backend system for data collection of DMP SDK. The system reduces the time to update data from a day to an hour and achieves a cost reduction of 40% for ETL machines.",
          "3. Deploy DMP Elastic Stack to validate and visualize data from each new client in real time.",
          "<h5>Data Architecture</h5>",
          "1. Introduce the Kubernetes Engine to automate the process of deployment and monitoring, significantly reducing the cost by 75% and the personnel expenses by 20 hours.",
          "2. Provide advices about architecture design as well as deployment of Kubernetes with Istio, Cloud Function, Apache Airflow, Compute Engine, Serverless service and so on.",
          "3. Develop internal bot notification system to provide instant error notifications of ETL states and Health Check Monitor.",
          "<h5>Data Application</h5>",
          "1. Build up a platform for highly customized tagging services. The platform gives each individual ID different kinds of tags such as personal interests, language, age, and gender and reports the tagging rate of each tag.",
          "2. Optimize the pipeline of data update to directly generate files and reports  and achieve a personnel expense reduction from 2 weeks to less than 1 hours.",
          "3. Replace previous VM/EMR environment for ETL with Apache Airflow and Kubernetes CronJob to make ETL pipeline more flexible and cost-effective. I also design new tools for team, it shows the cost(size) of every query.",
          "<h5>Continuous Integration and Deployment</h5>",
          "1. Design the complete CI/CD pipeline including building Docker images, deploying to Container Registry, 2-hours deploying images on the Kubernetes cluster, and deploying images on application environment after conducting unit tests.",
          "2. Build up Jenkins on the GKE and design related architectures to autmatically run ETL pipelines each day.",
          "<h5>Data Migration</h5>",
          "Migrate existing projects and the ETL pipeline from AWS to GCP. Transfer data from Hive and S3 to GCP. Set up a Gitlab server in GCP. Build up ETL pipelines for effective and efficient data migration, which is very important for team members to access the latest data on GCP."
      ]
    },
    {
      "title":"PDIS (Public Digital Innovation Space)",
      "image":"./assets/image/pdis.png",
      "location":"Executive Yuan 行政院, Taipei, Taiwan",
      "time":"2017 Sep -> 2018 Aug",
      "position":"Software Engineer in (Alternative Military Service)",
      "web":"<a href='https://pdis.nat.gov.tw' target='_blank'>PDIS</a>",
      "p":[
          "PDIS is a government organization in Taiwan, it also has another name: Executive Yuan - Ministry of Digital - Audrey Tang's 唐鳳 Office.
          She leads the PDIS team to help our government.
          We incubate and facilitate public digital innovation for government.
          ",
          "1: As a software developer: I use Line BOT API to connect our internal systems to make an easy-to-use app to help our colleagues saving their time. I also designed API interfaces to allow other internal systems to hook up with our bot system.Up to now, it already bridged across our meeting reserve system and electronic bulletin board system.",
          "2: About productive and quality: I designed a software that can display real-time subtitle during streaming. To meet the schedule, I took only one week to make it from idea to prototype. This system now works perfectly in all of our video conferences.",
          "3: As a quick learner and contributor: I involved in many open source projects. Like Sandstorm(A open source private cloud with the container), Rocket.Chat(A open source chat app which like Slack). We have fixed many issues and add lots of features, and giving back to the community.",
          "4: Eager to learn everything: when I have free time, I like to think about how to make the system more efficient. I still find more possibility to improve the current system. Like the subtitle display system, I would like to let some part of the system can automatically work. Let the computer can label the people with their name in real-time and display the information on the subtitle. On the road of development, I fixed various issues and bugs of Tensorflow. NVIDIA give me an award as the outstanding community developer in this April."
      ],
      "more":""
    },
    {
      "title":"91app (Nexdoor)",
      "image":"./assets/image/91app.jpg",
      "location":"Taipei, Taiwan",
      "time":"2013 Jul -> 2014 Sep",
      "position":"iOS Engineer (Intern)",
      "web":"<a href='https://www.91app.com' target='_blank'>Chinese(TW)</a>",
      "p":[
          "Nexdoor is a famous App company in 2013, we build iOS/Android/Web for the enterprise. I was an iOS Engineer Intern when I was an undergraduate student.
          I developed some interesting project, like Geofenece App, LBS Service framework and customize UI. In 2016, most of the employee join new company 91 app."
      ],
      "more":""
    }
  ]

}
