{
  "skills": [
    {
      "title":"Data",
      "p":[ "Kubernetes","Elasticsearch","Spark","Kafka", "Airflow"]
    },
    {
      "title":"Backend/Web",
      "p":["Node.js","Mongodb","Webpack","Sass"]
    },
    {
      "title":"General",
      "p":["Python","Git", "Google Cloud platform", "Jenkins","Docker","iOS(Swift)"]
    }
  ]
  ,"work":[
    {
      "title":"Vpon Taiwan",
      "image":"",
      "location":"Taipei, Taiwan",
      "time":"2018 Oct -> Present",
      "position":"Data Engineer (Architect)",
      "web":"<a href='https://www.vpon.com' target='_blank'>Vpon</a>",
      "p":[
          "In data team: I design new system infra with a new stack. I also help our member to solve their daily problems. Like Kubernetes with Istio and Serverless.",
          "1: Data migration: I help the data team to transfer existing projects from AWS to GCP. Example: Migrate the ETL pipeline from AWS to GCP. Moving our Gitlab from AWS to GCP (Gitlab CI/CD). Transfer data from Hive and S3 to GCP",
          "2: Infrastructure: We use Google Cloud Platform and Amazon Web Service. I designed the architecture of our system. Like the Gitlab CI/CD, ETL flow, Data processing pipeline. For example GKE(Google Kubernetes Engine) with Istio, BigQuery, Cloud Function, and GCE.",
          "3: CI/CD: Design CI/CD pipeline for our project. Our pipeline Build Docker Image, do Unit Test, then deploy to Container Registry. And these image will deploy on our Kubernetes cluster",
          "4: Data tagging service: A high customize tagging service, it processes our data with many kinds of the tag. It provides a view of people interests, language, age, gender and so on",
          "5: ETL pipeline: Our daily cronjob to process many kinds of data. Like the data exchange with our partners. I deployed jobs on Apache Airflow.",
          "6: Elastic Stack:  Processing 1 million record data every day. It can validate data and watch our report in real-time."
      ]
    },
    {
      "title":"PDIS (Public Digital Innovation Space)",
      "image":"./assets/image/pdis.png",
      "location":"Executive Yuan 行政院, Taipei, Taiwan",
      "time":"2017 Sep -> 2018 Aug",
      "position":"Software Engineer in (Alternative Military Service)",
      "web":"<a href='https://pdis.nat.gov.tw' target='_blank'>PDIS</a>",
      "p":[
          "PDIS is a government organization in Taiwan, it also has another name: Executive Yuan - Ministry of Digital - Audrey Tang's 唐鳳 Office.
          She leads the PDIS team to help our government.
          We incubate and facilitate public digital innovation for government.
          ",
          "1: As a software developer: I use Line BOT API to connect our internal systems to make an easy-to-use app to help our colleagues saving their time. I also designed API interfaces to allow other internal systems to hook up with our bot system.Up to now, it already bridged across our meeting reserve system and electronic bulletin board system.",
          "2: About productive and quality: I designed a software that can display real-time subtitle during streaming. To meet the schedule, I took only one week to make it from idea to prototype. This system now works perfectly in all of our video conferences.",
          "3: As a quick learner and contributor: I involved in many open source projects. Like Sandstorm(A open source private cloud with the container), Rocket.Chat(A open source chat app which like Slack). We have fixed many issues and add lots of features, and giving back to the community.",

          "4: Eager to learn everything: when I have free time, I like to think about how to make the system more efficient. I still find more possibility to improve the current system. Like the subtitle display system, I would like to let some part of the system can automatically work. Let the computer can label the people with their name in real-time and display the information on the subtitle. On the road of development, I fixed various issues and bugs of Tensorflow. NVIDIA give me an award as the outstanding community developer in this April."
      ],
      "more":""
    },
    {
      "title":"91app (Nexdoor)",
      "image":"./assets/image/91app.jpg",
      "location":"Taipei, Taiwan",
      "time":"2013 Jul -> 2014 Sep",
      "position":"iOS Engineer (Intern)",
      "web":"<a href='https://www.91app.com' target='_blank'>Chinese(TW)</a>",
      "p":[
          "Nexdoor is a famous App company in 2013, we build iOS/Android/Web for the enterprise. I was an iOS Engineer Intern when I was an undergraduate student.
          I developed some interesting project, like Geofenece App, LBS Service framework and customize UI. In 2016, most of the employee join new company 91 app."
      ],
      "more":""
    }
  ]

}
